Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/NonSecure/firmware/src/packs/PIC32CK2051SG01144_DFP/component/adc.h
/* -------- ADC_DBGCTRL : (ADC Offset: 0x168) (R/W 32) Debug Control Register -------- */
#define ADC_DBGCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (ADC_DBGCTRL) Debug Control Register  Reset Value */

#define ADC_DBGCTRL_DBGRUN_Pos                _UINT32_(0)                                          /* (ADC_DBGCTRL) Debug Running State Position */
#define ADC_DBGCTRL_DBGRUN_Msk                (_UINT32_(0x1) << ADC_DBGCTRL_DBGRUN_Pos)            /* (ADC_DBGCTRL) Debug Running State Mask */
#define ADC_DBGCTRL_DBGRUN(value)             (ADC_DBGCTRL_DBGRUN_Msk & (_UINT32_(value) << ADC_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the ADC_DBGCTRL register */
#define ADC_DBGCTRL_Msk                       _UINT32_(0x00000001)                                 /* (ADC_DBGCTRL) Register Mask  */


/** \brief ADC register offsets definitions */
#define ADC_CORCTRL_REG_OFST           _UINT32_(0x00)      /* (ADC_CORCTRL) SARCORE Control Offset */
#define ADC_CHNCFG1_REG_OFST           _UINT32_(0x04)      /* (ADC_CHNCFG1) Channel Configuration 1 (LVL/CMPEN) Offset */
#define ADC_CHNCFG2_REG_OFST           _UINT32_(0x08)      /* (ADC_CHNCFG2) Channel Configuration 2(FRACT/CSS) Offset */
#define ADC_CHNCFG3_REG_OFST           _UINT32_(0x0C)      /* (ADC_CHNCFG3) Channel Configuration3 (SIGN/DIFF) Offset */
#define ADC_CHNCFG4_REG_OFST           _UINT32_(0x10)      /* (ADC_CHNCFG4) Channel Configuration 4 (TRGSRC) Offset */
#define ADC_CHNCFG5_REG_OFST           _UINT32_(0x14)      /* (ADC_CHNCFG5) Channel Configuration 5 (TRGSRC) Offset */
#define ADC_CALCTRL_REG_OFST           _UINT32_(0x18)      /* (ADC_CALCTRL) SARCORE Calibration Value Offset */
#define ADC_EVCTRL_REG_OFST            _UINT32_(0x1C)      /* (ADC_EVCTRL) Event Control Offset */
#define ADC_INTENCLR_REG_OFST          _UINT32_(0x00)      /* (ADC_INTENCLR) Interrupt Enable Clear Offset */
#define ADC_INTENSET_REG_OFST          _UINT32_(0x04)      /* (ADC_INTENSET) Interrupt Enable Set Offset */
#define ADC_INTFLAG_REG_OFST           _UINT32_(0x08)      /* (ADC_INTFLAG) Interrupt Flags Offset */
#define ADC_CTRLA_REG_OFST             _UINT32_(0x00)      /* (ADC_CTRLA) CONTROL A REGISTER Offset */
#define ADC_CTRLB_REG_OFST             _UINT32_(0x04)      /* (ADC_CTRLB) CONTROL B REGISTER Offset */
#define ADC_CTRLC_REG_OFST             _UINT32_(0x08)      /* (ADC_CTRLC) Control C Register Offset */
#define ADC_CTRLD_REG_OFST             _UINT32_(0x10)      /* (ADC_CTRLD) Control D Register Offset */
#define ADC_CMPCTRL_REG_OFST           _UINT32_(0xB0)      /* (ADC_CMPCTRL) Comparator Control Offset */
#define ADC_FLTCTRL_REG_OFST           _UINT32_(0xC0)      /* (ADC_FLTCTRL) Filter Control Offset */
#define ADC_CORCHDATAID_REG_OFST       _UINT32_(0xD0)      /* (ADC_CORCHDATAID) Channel Ready DATA ID Offset */
#define ADC_CHRDYDAT_REG_OFST          _UINT32_(0xD4)      /* (ADC_CHRDYDAT) Channel Ready Data Register Offset */
#define ADC_PFFDATA_REG_OFST           _UINT32_(0xD8)      /* (ADC_PFFDATA) APB FIFO Output Data Offset */
#define ADC_DMABASE_REG_OFST           _UINT32_(0xDC)      /* (ADC_DMABASE) DMA Sample Base Address Offset */
#define ADC_DMACTRL_REG_OFST           _UINT32_(0xE0)      /* (ADC_DMACTRL) DMA Control Register Offset */
#define ADC_PFFCTRL_REG_OFST           _UINT32_(0xE4)      /* (ADC_PFFCTRL) APB FIFO Control Register Offset */
#define ADC_SYNCBUSY_REG_OFST          _UINT32_(0xE8)      /* (ADC_SYNCBUSY) CORE SYNC Busy Status Register Offset */
#define ADC_DMAINTENCLR_REG_OFST       _UINT32_(0xF0)      /* (ADC_DMAINTENCLR) DMA Interrupt Enable Clear Offset */
#define ADC_DMAINTSET_REG_OFST         _UINT32_(0xF4)      /* (ADC_DMAINTSET) DMA Interrupt Enable Set Offset */
#define ADC_DMAINTFLAG_REG_OFST        _UINT32_(0xF8)      /* (ADC_DMAINTFLAG) DMA Interrupt Flag and Status Offset */
#define ADC_CTLINTENSET_REG_OFST       _UINT32_(0xFC)      /* (ADC_CTLINTENSET) CORE Controller Interrupt Enable Set Offset */
#define ADC_CTLINTENCLR_REG_OFST       _UINT32_(0x100)     /* (ADC_CTLINTENCLR) CORE Controller Interrupt Enable Clear Offset */
#define ADC_CTLINTFLAG_REG_OFST        _UINT32_(0x104)     /* (ADC_CTLINTFLAG) CORE Controller Interrupt Flags Offset */
#define ADC_DBGCTRL_REG_OFST           _UINT32_(0x168)     /* (ADC_DBGCTRL) Debug Control Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CONFIG register API structure */
typedef struct
{
  __IO  uint32_t                       ADC_CORCTRL;        /**< Offset: 0x00 (R/W  32) SARCORE Control */
  __IO  uint32_t                       ADC_CHNCFG1;        /**< Offset: 0x04 (R/W  32) Channel Configuration 1 (LVL/CMPEN) */
  __IO  uint32_t                       ADC_CHNCFG2;        /**< Offset: 0x08 (R/W  32) Channel Configuration 2(FRACT/CSS) */
  __IO  uint32_t                       ADC_CHNCFG3;        /**< Offset: 0x0C (R/W  32) Channel Configuration3 (SIGN/DIFF) */
  __IO  uint32_t                       ADC_CHNCFG4;        /**< Offset: 0x10 (R/W  32) Channel Configuration 4 (TRGSRC) */
  __IO  uint32_t                       ADC_CHNCFG5;        /**< Offset: 0x14 (R/W  32) Channel Configuration 5 (TRGSRC) */
  __IO  uint32_t                       ADC_CALCTRL;        /**< Offset: 0x18 (R/W  32) SARCORE Calibration Value */
  __IO  uint32_t                       ADC_EVCTRL;         /**< Offset: 0x1C (R/W  32) Event Control */
} adc_config_registers_t;

/** \brief INT register API structure */
typedef struct
{
  __IO  uint32_t                       ADC_INTENCLR;       /**< Offset: 0x00 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       ADC_INTENSET;       /**< Offset: 0x04 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       ADC_INTFLAG;        /**< Offset: 0x08 (R/W  32) Interrupt Flags */
  __I   uint8_t                        Reserved1[0x04];
} adc_int_registers_t;

#define ADC_CONFIG_NUMBER 1

#define ADC_INT_NUMBER 1

/** \brief ADC register API structure */
typedef struct
{  /* ADC Controller */
  __IO  uint32_t                       ADC_CTRLA;          /**< Offset: 0x00 (R/W  32) CONTROL A REGISTER */
  __IO  uint32_t                       ADC_CTRLB;          /**< Offset: 0x04 (R/W  32) CONTROL B REGISTER */
  __IO  uint32_t                       ADC_CTRLC;          /**< Offset: 0x08 (R/W  32) Control C Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       ADC_CTRLD;          /**< Offset: 0x10 (R/W  32) Control D Register */
  __I   uint8_t                        Reserved2[0x0C];
        adc_config_registers_t         CONFIG[ADC_CONFIG_NUMBER]; /**< Offset: 0x20  */
  __I   uint8_t                        Reserved3[0x70];
  __IO  uint32_t                       ADC_CMPCTRL;        /**< Offset: 0xB0 (R/W  32) Comparator Control */
  __I   uint8_t                        Reserved4[0x0C];
  __IO  uint32_t                       ADC_FLTCTRL;        /**< Offset: 0xC0 (R/W  32) Filter Control */
  __I   uint8_t                        Reserved5[0x0C];
  __IO  uint32_t                       ADC_CORCHDATAID;    /**< Offset: 0xD0 (R/W  32) Channel Ready DATA ID */
  __IO  uint32_t                       ADC_CHRDYDAT;       /**< Offset: 0xD4 (R/W  32) Channel Ready Data Register */
  __I   uint32_t                       ADC_PFFDATA;        /**< Offset: 0xD8 (R/   32) APB FIFO Output Data */
  __IO  uint32_t                       ADC_DMABASE;        /**< Offset: 0xDC (R/W  32) DMA Sample Base Address */
  __IO  uint32_t                       ADC_DMACTRL;        /**< Offset: 0xE0 (R/W  32) DMA Control Register */
  __IO  uint32_t                       ADC_PFFCTRL;        /**< Offset: 0xE4 (R/W  32) APB FIFO Control Register */
  __I   uint32_t                       ADC_SYNCBUSY;       /**< Offset: 0xE8 (R/   32) CORE SYNC Busy Status Register */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       ADC_DMAINTENCLR;    /**< Offset: 0xF0 (R/W  32) DMA Interrupt Enable Clear */
  __IO  uint32_t                       ADC_DMAINTSET;      /**< Offset: 0xF4 (R/W  32) DMA Interrupt Enable Set */
  __IO  uint32_t                       ADC_DMAINTFLAG;     /**< Offset: 0xF8 (R/W  32) DMA Interrupt Flag and Status */
  __IO  uint32_t                       ADC_CTLINTENSET;    /**< Offset: 0xFC (R/W  32) CORE Controller Interrupt Enable Set */
  __IO  uint32_t                       ADC_CTLINTENCLR;    /**< Offset: 0x100 (R/W  32) CORE Controller Interrupt Enable Clear */
  __IO  uint32_t                       ADC_CTLINTFLAG;     /**< Offset: 0x104 (R/W  32) CORE Controller Interrupt Flags */
  __I   uint8_t                        Reserved7[0x18];
        adc_int_registers_t            INT[ADC_INT_NUMBER]; /**< Offset: 0x120  */
  __I   uint8_t                        Reserved8[0x38];
  __IO  uint32_t                       ADC_DBGCTRL;        /**< Offset: 0x168 (R/W  32) Debug Control Register */
} adc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CKSG01_ADC_COMPONENT_H_ */
